{"pageProps":{"Data":{"id":"about","data":{"sectionName":"About","title":"Michael Jayne","subtitle":"Nice to meet you,<br/>Allow me to introduce myself.","description":"A little bit about me and what I can do.","src":"/assets/misc/mikeJayne.JPG","alt":"A picture of me","slug":"about","tabNames":["About Me","My Skills"],"skills":[["Python","/assets/skills/python.png"],["TensorFlow","/assets/skills/tensor.png"],["HTML","/assets/skills/html.png"],["CSS","/assets/skills/css.png"],["Tailwind","/assets/skills/tailwind.png"],["Javascript","/assets/skills/javascript.png"],["React.js","/assets/skills/react.png"],["D3.js","/assets/skills/d3.png"],["Node.js","/assets/skills/node.png"],["Anaconda3","/assets/skills/anaconda.png"],["GitHub","/assets/skills/github1.png"],["VS Code","/assets/skills/vscode.png"],["Jupyter","/assets/skills/jupyter.png"]]},"content":"<p>My name is Michael Jayne and I love\ndeveloping tools to make tedious tasks, simple.</p>\n<p>My interests for problem solving began long before I\ntook up development, and as early as I can remember.\nMy first interactions with some type of development\nwere a CAD design course, and a robotics course both\noffered at my highschool. However, when it came to\ncollege, I chose a chemical engineering degree, not\nquite yet knowing where I wanted to head in life.</p>\n<p>After graduation, I still felt uncertain about what\nlie ahead. And after about a month of thinking, I\nthought I'd give pharmaceutical development a\ntry, but after a little less than a year with a\nrelated job and coursework, I also knew this\nwasn't right for me.</p>\n<p>I finally realized my love for development a litle\nover a year ago. While developing a mediocre google\nsheets app for tracking working out and\nperiodization for workout programs, I ended up\nstumbling into google API... and then I just kept\ngoing until I decided it was time to access some\nreal educational content. And since then, I've\ntaken up the challenge to build, not only my\nknowledge and undestanding of developement, but my\ncarrer as well.</p>\n"}},"__N_SSG":true}